Repository: bilqeessait/NaqshbandiApp
Catalog: Pages/SpecialSalaahs/TahajjudSalaah.*.resx
Languages: af, xh

# Greeting
source: Assalaamu Alaykum, how are you?
af: Assalaamu Alaykum, hoe gaan dit?
xh: Assalaamu Alaykum, unjani?

# s0
source: The Salah of Tahajjud
af: Die Salah vanTahajjud
xh: ISalah yaseTahajjud

# s1
source: (i) Consists of two to any number of rak’ahs. The best time to perform this salah is during the last third part of the night, and to perform the Salah of Witr afterwards.
af: (i) Bestaan ​​uit twee tot enige aantal rak'ahs. Die beste tyd om hierdie salah uit te voer is gedurende die laaste derde deel van die nag, en om die Salah van Witr daarna uit te voer.
xh: (i) Ibandakanya ezimbini ukuya kulo naliphi na inani leerakah. Elona xesha lilungileyo lokwenza le salah kukwisiqingatha sesithathu sokugqibela sobusuku, kwaye wenze iSalah yaseWitr emva koko.

# s10
source: (ii) The niyyah for the Salah of Tahajjud is as follows:
af: (ii) Die niyyah vir die Salah van Tahajjud is soos volg:
xh: (ii) I-niyyah ye-Salah ye-Tahajjud ihamba ngolu hlobo lulandelayo:

# s11
source: Bismilla hirahma nirrahim Nawaitu usalli rak'ataini sunnata salatit-tahajjud lillahi ta-ala {In the Name of Allah, the Most Merciful, the Most Beneficent. I intend to pray (the) two cycles (of) the supererogatory prayer of Tahajjud for the sake of Allah, the Most High.}
af: Bismilla hirahma nirrahim Nawaitu usalli rak'ataini sunnata salatit-tahajjud lillahi ta-ala {In die Naam van Allah, die Mees Barmhartige, die Mees Barmhartige. Ek is van plan om (die) twee siklusse (van) die supererogatory gebed van Tahajjud te bid ter wille van Allah, die Allerhoogste.}
xh: Bismilla hirahma nirrahim Nawaitu usalli rak'atini sunnata salatit-tahajjud lillahi ta-ala {Egameni lika-Allah, uSozinceba, uSozinceba. Ndizimisele ukuthandaza (imijikelo) emibini yomthandazo weTahajjud ngenxa ka-Allh Osenyangweni.}

# s12
source: (iii) Recite in each rak’ah the Fatihah and any Surah or verses from the Qur’an.
af: (iii) Sê in elke rak'ah die Fatihah en enige Surah of verse uit die Koran op.
xh: (iii) Cengceleza kwirak’ah nganye iFatiha kunye nayo nayiphi na iSurah okanye iivesi zeKur’an.

# s13
source: (iv) Make the following du'a afterwards:
af: (iv) Maak die volgende du'a daarna:
xh: (iv) Yenza le dua ilandelayo emva koko:

# s15
source: {In the Name of Allah, the Most Merciful, the Most Beneficent. O Allah! All praise belongs to Thee. Thou art the Sustainer of the heavens and of the earth and whatever is therein. All praise belongs to Thee. Thou art the Ruler of the heavens and of the earth and whatever is therein. All praise belongs to Thee. Thou art the Light of the heavens and of the earth and whatever is therein. All praise belongs to Thee. Thou art the Truth, Thy promise is the truth, the meeting with Thee is the truth, Thy words are the truth, the Jannah is the truth, the Fire is the truth, the Prophets are the truth, Muhammad (may the peace and blessings of Allah be upon him) is the truth, the Hour is the truth. O Allah! To Thee do I submit, in Thee do I believe, on Thee do I depend, to Thee is my return, with Thee do I defeat my opponent in argument, to Thee do I turn for judgement. Forgive me for what I have done in the past and what I will commit in the future, what I conceal and what I reveal; and all this Thou knowest better than me. Thou art the One Who causes advancement and the One Who causes delay. There is no god other than Thee. And there is no power and strength other than with Allah.}
af: {In die Naam van Allah, die Mees Barmhartige, die Mees Barmhartige. O Allah! Alle lof behoort aan U. U is die Onderhouer van die hemel en die aarde en alles wat daarin is. Alle lof behoort aan U. U is die Heerser van die hemel en die aarde en alles wat daarin is. Alle lof behoort aan U. U is die Lig van die hemel en van die aarde en alles wat daarin is. Alle lof behoort aan U. U is die Waarheid, U belofte is die waarheid, die ontmoeting met U is die waarheid, U woorde is die waarheid, die Jannah is die waarheid, die Vuur is die waarheid, die Profete is die waarheid, Mohammed (mag die vrede en seëninge van Allah op hom) is die waarheid, die Uur is die waarheid. O Allah! Aan U onderwerp ek my, in U glo ek, van U is ek afhanklik, aan U is my terugkeer, saam met U verslaan ek my teenstander in argument, na U wend ek my vir oordeel. Vergewe my vir wat ek in die verlede gedoen het en wat ek in die toekoms sal pleeg, wat ek verberg en wat ek openbaar; en dit alles weet U beter as ek. U is die Een wat vooruitgang veroorsaak en die Een wat vertraging veroorsaak. Daar is geen ander god as U nie. En daar is geen krag en krag anders as by Allah nie.}
xh: {Egameni lika-Allh, uSozinceba, uSozinceba. Owu Allah! Lonke ukubonga ngakuWe. Wena unguMlondolozi wamazulu nomhlaba nako konke okukuwo. Lonke ukubonga ngakuWe. Wena unguMlawuli wamazulu nomhlaba nako konke okukuwo. Lonke ukubonga ngakuWe. UluKhanya lwamazulu nomhlaba nako konke okukuwo. Lonke ukubonga ngakuWe. Wena uyiNyaniso, idinga lakho liyinyaniso, ukuhlangana nawe yinyaniso, amazwi akho ayinyaniso, iJannah yinyaniso, uMlilo yinyaniso, abaProfeti bayinyaniso, uMuhammad (uxolo nentsikelelo). ka-Allh makabe phezu kwakhe) yinyaniso, iyure iyinyaniso. Owu Allah! Ndiyazithoba kuWe, Ndiyakholwa kuwe, Ndithembele kuWe, Kuwe ukubuya kwam, Ndimoyisa kuwe umchasi wam ngengxabano, Ndibheke kuwe ukuba ndigwebe. Ndixoleleni ngezinto endizenzileyo ngaphambili, nendiza kuzenza kwixesha elizayo, endizifihlayo nendizityhilayo; kwaye konke oku ukwazi bhetele kunam. Wena unguLowo wenza inkqubela yaye unguLowo ulibazisa. Akukho Thixo wumbi ngaphandle kwakho. Kwaye akukho mandla namandla ngaphandle koAllh.}

# s2
source: (ii) Prior to the niyyah, say each of the following 10 times:
af: (ii) Voor die niyyah, sê elk van die volgende 10 keer:
xh: (ii) Phambi kwe-niyyah, yithi ngalinye kula maxesha ali-10 alandelayo:

# s3
source: Allahu akbar {Allah is the Greatest.}
af: Allahu akbar {Allah is die Grootste.}
xh: Allahu akbar {uAllh ngoyena mkhulu.}

# s4
source: Alhamdu lillah {All praise is due to Allah.}
af: Alhamdu lillah {Alle lof kom Allah toe.}
xh: Alhamdu lillah {Yonke indumiso mayibe kuAllâh.}

# s5
source: Subhanallahi wa bihamdih {Free of all imperfection is Allah, and to Him is all praise.}
af: Subhanallahi wa bihamdih {Vry van alle onvolmaaktheid is Allah, en aan Hom is alle lof.}
xh: Subhanallahi wa bihamdih {UAllâh Ukhululekile kuko konke ukungafezeki, kwaye yonke indumiso iya kuYe.}

# s6
source: Subhanal quddus {Free of all imperfection is the Most Holy.}
af: Subhanal quddus {Vry van alle onvolmaaktheid is die Allerheiligste.}
xh: Subhanal quddus {Ikhululekile kuko konke ukungafezeki yiNgcwele kaNgcwele.}

# s7
source: Astaghfirullah {I seek forgiveness from Allah.}
af: Astaghfirullah {Ek soek vergifnis van Allah.}
xh: Astaghfirullah {Ndicela uxolo kuAllh.}

# s8
source: La ilaha illallah {There is no god other than Allah.}
af: La ilaha illallah {Daar is geen ander god as Allah nie.}
xh: La ilaha illallah {Akukho thixo wumbi ngaphandle koAllh.}

# s9
source: Allahumma inni a’udhu bika min diqid dunya wa diqi yaumil qiyamati {O Allah! I seek Thy protection from the constraint of this world and the constraint of the Hereafter.}
af: Allahumma inni a'udhu bika min diqid dunya wa diqi yaumil qiyamati {O Allah! Ek soek U beskerming teen die beperking van hierdie wêreld en die beperking van die Hiernamaals.}
xh: Allahumma inni a’udhu bika min diqid dunya wa diqi yaumil qiyamati {O Allah! Ndifuna ukhuseleko lwaKho kumnyanzelo weli hlabathi nakuMnyanzelo weLizayo.}

# title
source: Special Salaahs
af: Spesiale Salaahs
xh: IiSalaah ezikhethekileyo
